# 1
# Пользователь вводит с клавиатуры количество бит памяти и единицу измерения в которую хочет перевести, программа
# выводит количество памяти в указанной единице измерения
# a = int(input())
# b = input()
# if b == 'Б':
#     s = a / 8
# elif b == 'Кб':
#     s = a / (8 * 1024)
# elif b == 'Мб':
#     s = a / (8 * 1024 * 1024)
# elif b == 'Гб':
#     s = a / (8 * 1024 * 1024 * 1024)
# elif b == 'Тб':
#     s = a / (8 * 1024 * 1024 * 1024 * 1024)
# print(s)

# 2
# Пользователь вводит количество градусов цельсия, программа переводит их в фаренгейты
# c = int(input())
# f = (c * 1.8) + 32
# if c == -40:
#     f = c
# print(f)

# 3
# Пользователь вводит предложение, программа должна найти букву которая больше всего раз встречается в этом предложении
# a = input('Введите предложение: ')
# print(max(a, key=len))

# 4
# Пользователь вводит предложение, необходимо найти количество слов в предложении с учетом нескольких пробелов подряд
# a = input('Введите предложение: ')
# for i in s:
#     print(i)
#     if i == '':
#         s.remove(i)
# print((s))

# 5
# Пользователь вводит предложение, программа должна найти самое длинное слово в этом предложении
# a = input('Введите предложение: ')
# s = a.split(' ')
# max = 0
# for i in s:
#     n = len(i)
#     if n > max:
#         max = n
# print(max)

# 6
# Пользователь вводит предложение, программа должна найти количество букв, цифр и пробелов в этом предложении
# from string import *
# a = input('Введите предложение: ')
# count_bukvi = 0
# count_cifri = 0
# count_tub = 0
# for i in a:
#     if i in ascii_letters:
#         count_bukvi += 1
#     elif i in digits:
#         count_cifri += 1
#     elif i in ' ':
#         count_tub += 1
# print(count_bukvi, count_cifri, count_tub)



